In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [2]:
sk = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+sk
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [16]:
def rentals_month(engine, month, year):
    query = f"""
    SELECT rental_id, rental_date, customer_id
    FROM rental
    WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}
    """
    return pd.read_sql(query, engine)

In [17]:
def rental_count_month(rentals_df, month, year):
    """
    Computes the number of rentals made by each customer during the specified month and year.

    Parameters:
    - rentals_df: A Pandas DataFrame containing rental data for the specified month and year.
    - month: Integer representing the month (1-12) for which to count rentals.
    - year: Integer representing the year for which to count rentals.

    Returns:
    - A new Pandas DataFrame with customer_id and the number of rentals in the format "rentals_mm_yyyy".
    """
    # Create the column name based on the month and year
    column_name = f"rentals_{month:02d}_{year}"

    # Group the DataFrame by customer_id and count the number of rentals
    rental_counts = rentals_df.groupby('customer_id').size().reset_index(name=column_name)

    return rental_counts

In [18]:
def compare_rentals(df1, df2, month1, year1, month2, year2):
    df = pd.merge(df1, df2, on='customer_id', how='inner', suffixes=(f'_{month1:02}_{year1}', f'_{month2:02}_{year2}'))
    df['difference'] = df[f'rentals_{month1:02}_{year1}'] - df[f'rentals_{month2:02}_{year2}']
    return df

In [19]:
# Fetch rental data for May 2005
may_rentals = rentals_month(engine, 5, 2005)
may_rental_count = rental_count_month(may_rentals, 5, 2005)

display(may_rentals)
display(may_rental_count)
# Fetch rental data for June 2005
june_rentals = rentals_month(engine, 6, 2005)
june_rental_count = rental_count_month(june_rentals, 6, 2005)

# Compare the rental counts for May and June
comparison = compare_rentals(may_rental_count, june_rental_count, 5, 2005, 6, 2005)
comparison = comparison.reset_index()

# Display the result
display(comparison)

      rental_id         rental_date  customer_id
0             1 2005-05-24 22:53:30          130
1             2 2005-05-24 22:54:33          459
2             3 2005-05-24 23:03:39          408
3             4 2005-05-24 23:04:41          333
4             5 2005-05-24 23:05:21          222
...         ...                 ...          ...
1151       1153 2005-05-31 21:36:44          506
1152       1154 2005-05-31 21:42:09           59
1153       1155 2005-05-31 22:17:11          251
1154       1156 2005-05-31 22:37:34          106
1155       1157 2005-05-31 22:47:45           61

[1156 rows x 3 columns]

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

     index  customer_id  rentals_05_2005  rentals_06_2005  difference
0        0            1                2                7          -5
1        1            2                1                1           0
2        2            3                2                4          -2
3        3            5                3                5          -2
4        4            6                3                4          -1
..     ...          ...              ...              ...         ...
507    507          594                4                6          -2
508    508          595                1                2          -1
509    509          596                6                2           4
510    510          597                2                3          -1
511    511          599                1                4          -3

[512 rows x 5 columns]